package 주식정보시스템;

public class 마무리복습{
//	1. 기본형 형변환 중, 아래 코드를 수정해보세요.
//		int x = 100;
//		byte y = x; ==> byte y = (byte)x;
//	2. 참조형 형변환이 되는 조건은? ==> 상속 관계의 객체들만 가능
//	3. 상속에서 위에 물려주는 클래스를 무엇이라고 부르는가? ==> 자식,서브 클래스
//	4. 상속에서 아래 물려받는 클래스를 무엇이라고 부르는가? ==> 부모,슈퍼 클래스
//	5. 상속을 사용할 때 키워드는 다음중 무엇? 1) extend 2) extends 3) implements
//		==> 2번
//	6. 기본형 데이터 4가지 ==> 정수, 실수, 문자1개, 논리
//	7. 참조형 데이터 2가지 이상 ==> 배열, 클래스
//	8. 참조형 형변환 중, 아래 코드를 수정해보세요.
//	   Car c = new Car();
//	   Truck t = new Truck(); //Truck은 Car를 상속받아 만들었음.
//	   t = c; //수정해보세요. ==> t = (Truck)c;
//	9. 기본형, 참조형 변수에 각각 들어있는 것은? ==> 기본형(값), 참조형(주소)
//	10. 참조형 변수를 초기화하려고 한다. 무엇으로 초기화해야할까? ==> null;
//	11. null이란?
//	12. 포장클래스(랩퍼클래스)란? 종류 2가지 
//		==> 기초형에서 참조형으로 형변환할 때 사용하는 클래스/Integer, Double(포장클래스는 앞이 대문자)
//	13. 업캐스팅이란? ==> 자동 형변환 : 작은 것에서 큰 것 or 자식에서 부모 클래스로 형변환할때 자동으로 가능
//	14. 다운캐스팅이란? ==> 강제 형변환 : 자동 형변환과 반대로 이동할 때 강제로 형변환 해주는 것
}
